"""
파일 이름 : cate_extractor.py
파일 용도 :
 대분류 받아서 소분류 추출하기
 소분류 받아서 대분류 추출하기
파일 작성 : woo
작성 날짜 : 2025-12-10

"""

# ===== ===== ===== ===== ===== ===== ===== ===== ===== =====
# !!! import
# ===== ===== ===== ===== ===== ===== ===== ===== ===== =====

import math


# ===== ===== ===== ===== ===== ===== ===== ===== ===== =====
# !!! 함수 ( 메서드 )
# ===== ===== ===== ===== ===== ===== ===== ===== ===== =====

def parent_to_cate_list(parent) :
    """
    # 대분류 받아서 소분류 추출하기
    """
    cate_s = parent * 10 + 9
    cate_e = (parent + 1) * 10 + 8
    cate_li = list(range(cate_s, cate_e + 1))
    return cate_li

def cate_to_parent(cate) :
    """
    # 소분류 받아서 대분류 추출하기
    """
    parent = math.ceil((cate - 8) / 10)
    return parent

# ===== ===== ===== ===== ===== ===== ===== ===== ===== =====
# !!! Templaet 함수 ( 메서드 ) QED
# ===== ===== ===== ===== ===== ===== ===== ===== ===== =====

def temp() :
    """
    # Temp의 Docstring
    """
    return None


# ===== ===== ===== ===== ===== ===== ===== ===== ===== =====
# !!!
# ===== ===== ===== ===== ===== ===== ===== ===== ===== =====
